components/openfoam-smartsim/tutorials/functionObject/pitzDaily/Allrun
#!/usr/bin/bash
export SSKEYIN=$SSKEYOUT
blockMesh
simpleFoam
